<a href="https://colab.research.google.com/github/Surekha8Rajbhar/MSCIT_part_1_FDS_Practical/blob/main/Practical3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
Data Preprocessing and Data Transformation
It is important to be able to extract, filter and transform data from DataFrame inorder to drill into the data that really matters. Pandas library has many techniques that makes this method efficient and intuitive.

In [1]:
import pandas as pd
import numpy as np
cols=['col0', 'col1', 'col2', 'col3', 'col4']
rows=['row0', 'row1', 'row2', 'row3', 'row4']
data=np.random.randint(0, 100, size=(5,5))
df=pd.DataFrame(data, columns=cols, index=rows)
df.head()

      col0  col1  col2  col3  col4
row0    40    95    61    97    56
row1    92    54    95    11    95
row2     7    92    54    11    59
row3     7    36    91    53    63
row4    80    45    67     5    92

In [2]:
df['col1']['row1']

54

In [3]:
df.iloc[4, 2]

67

In [4]:
df.loc['row4','col2']

67

In [5]:

df_new=df[['col1', 'col2']]
df_new.head()

      col1  col2
row0    95    61
row1    54    95
row2    92    54
row3    36    91
row4    45    67

In [6]:
df_new=df[['col1', 'col2']][1:4]
df_new.head(3)

      col1  col2
row1    54    95
row2    92    54
row3    36    91

In [7]:
df.loc[:,'col0']
df.iloc[:, 0]

row0    40
row1    92
row2     7
row3     7
row4    80
Name: col0, dtype: int64

In [8]:
df['col3'][2:5]

row2    11
row3    53
row4     5
Name: col3, dtype: int64

In [9]:
df.loc['row1': 'row4',:]

      col0  col1  col2  col3  col4
row1    92    54    95    11    95
row2     7    92    54    11    59
row3     7    36    91    53    63
row4    80    45    67     5    92

In [10]:
df.iloc[1:4, :]

      col0  col1  col2  col3  col4
row1    92    54    95    11    95
row2     7    92    54    11    59
row3     7    36    91    53    63

In [11]:
df.loc[:,'clo1': 'col4']

      col0  col1  col2  col3  col4
row0    40    95    61    97    56
row1    92    54    95    11    95
row2     7    92    54    11    59
row3     7    36    91    53    63
row4    80    45    67     5    92

In [12]:
df.iloc[:, 1:4]

      col1  col2  col3
row0    95    61    97
row1    54    95    11
row2    92    54    11
row3    36    91    53
row4    45    67     5

In [13]:
df.loc['row1':'row4', 'col1':'col4']

      col1  col2  col3  col4
row1    54    95    11    95
row2    92    54    11    59
row3    36    91    53    63
row4    45    67     5    92

In [14]:
df.iloc[1:4,1:4]

      col1  col2  col3
row1    54    95    11
row2    92    54    11
row3    36    91    53

In [15]:
df.loc['row2':'row4', ['col1', 'col3']]

      col1  col3
row2    92    11
row3    36    53
row4    45     5

In [16]:
df.iloc[[2,4],0:4]

      col0  col1  col2  col3
row2     7    92    54    11
row4    80    45    67     5

In [17]:
df.head()

      col0  col1  col2  col3  col4
row0    40    95    61    97    56
row1    92    54    95    11    95
row2     7    92    54    11    59
row3     7    36    91    53    63
row4    80    45    67     5    92

In [18]:
#Filtering Pandas
df[df['col1']>20]
condition=df['col1']>20
df[condition]

      col0  col1  col2  col3  col4
row0    40    95    61    97    56
row1    92    54    95    11    95
row2     7    92    54    11    59
row3     7    36    91    53    63
row4    80    45    67     5    92

In [19]:
df[(df['col1']>25) & (df['col3']<30)] #logical AND

      col0  col1  col2  col3  col4
row1    92    54    95    11    95
row2     7    92    54    11    59
row4    80    45    67     5    92

In [20]:
df[(df['col1']>25) | (df['col3']<30)] #logical OR

      col0  col1  col2  col3  col4
row0    40    95    61    97    56
row1    92    54    95    11    95
row2     7    92    54    11    59
row3     7    36    91    53    63
row4    80    45    67     5    92

In [22]:
df[~(df['col3']<30)] #Logical NOT

      col0  col1  col2  col3  col4
row0    40    95    61    97    56
row3     7    36    91    53    63

In [ ]:
dealing with 0 and NAN values

In [23]:
df.iloc[1, 2]=np.nan
df.iloc[4, 0]=np.nan
df['col5']=0
df['col6']=np.nan
df.head()

      col0  col1  col2  col3  col4  col5  col6
row0  40.0    95  61.0    97    56     0   NaN
row1  92.0    54   NaN    11    95     0   NaN
row2   7.0    92  54.0    11    59     0   NaN
row3   7.0    36  91.0    53    63     0   NaN
row4   NaN    45  67.0     5    92     0   NaN

In [24]:
#use all() method to select columns that don't have zero values
df.loc[:, df.all()]

      col0  col1  col2  col3  col4  col6
row0  40.0    95  61.0    97    56   NaN
row1  92.0    54   NaN    11    95   NaN
row2   7.0    92  54.0    11    59   NaN
row3   7.0    36  91.0    53    63   NaN
row4   NaN    45  67.0     5    92   NaN

In [25]:
#display column that have atleast one non zero value
df.loc[:, df.any()]

      col0  col1  col2  col3  col4
row0  40.0    95  61.0    97    56
row1  92.0    54   NaN    11    95
row2   7.0    92  54.0    11    59
row3   7.0    36  91.0    53    63
row4   NaN    45  67.0     5    92

In [26]:
#select columns with any nan
df.loc[:,df.isnull().any()]

      col0  col2  col6
row0  40.0  61.0   NaN
row1  92.0   NaN   NaN
row2   7.0  54.0   NaN
row3   7.0  91.0   NaN
row4   NaN  67.0   NaN

In [27]:
#select column withou nan
df.loc[:, df.notnull().all()]

      col1  col3  col4  col5
row0    95    97    56     0
row1    54    11    95     0
row2    92    11    59     0
row3    36    53    63     0
row4    45     5    92     0

In [28]:
df.dropna(how="all", axis=1) #if all the values in columns ar enan it will be dropped

      col0  col1  col2  col3  col4  col5
row0  40.0    95  61.0    97    56     0
row1  92.0    54   NaN    11    95     0
row2   7.0    92  54.0    11    59     0
row3   7.0    36  91.0    53    63     0
row4   NaN    45  67.0     5    92     0

In [29]:
df.dropna(how="any", axis=1) #if all the values in row are nan it will be dropped

      col1  col3  col4  col5
row0    95    97    56     0
row1    54    11    95     0
row2    92    11    59     0
row3    36    53    63     0
row4    45     5    92     0

In [30]:
df['col1'][df['col2']>35]

row0    95
row2    92
row3    36
row4    45
Name: col1, dtype: int64

In [31]:
df['col1'][df['col2']>35]+=5
df['col1']

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

row0    100
row1     54
row2     97
row3     41
row4     50
Name: col1, dtype: int64

In [ ]:
Transforming Dataframe

In [32]:
def some_func(x):
  return x*2
df.apply(some_func) #update each entry of dataframe without any loop
df.apply(lambda n: n*2) #lambda also works the same

       col0  col1   col2  col3  col4  col5  col6
row0   80.0   200  122.0   194   112     0   NaN
row1  184.0   108    NaN    22   190     0   NaN
row2   14.0   194  108.0    22   118     0   NaN
row3   14.0    82  182.0   106   126     0   NaN
row4    NaN   100  134.0    10   184     0   NaN

In [33]:
#these function do not return the transformation so we have to store it explicitly
df['new_col']=df['col4'].apply(lambda n: n*2)
df.head()

      col0  col1  col2  col3  col4  col5  col6  new_col
row0  40.0   100  61.0    97    56     0   NaN      112
row1  92.0    54   NaN    11    95     0   NaN      190
row2   7.0    97  54.0    11    59     0   NaN      118
row3   7.0    41  91.0    53    63     0   NaN      126
row4   NaN    50  67.0     5    92     0   NaN      184

In [34]:
#if index is a string it has a .str accessor that allows us to modify entire index at once
df.index.str.upper()

Index(['ROW0', 'ROW1', 'ROW2', 'ROW3', 'ROW4'], dtype='object')

In [36]:
#we can't use apply method on index, alternative method is map
df.index=df.index.map(str.lower)

In [ ]:
Transforming function in Python

In [37]:
import pandas as pd
import numpy as np

In [38]:
#creating a dataframe
df=pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]), columns=['a', 'b', 'c'])

In [39]:
df

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [40]:
#applying the transform function
df.transform(func = lambda x : x * 10)

    a   b   c
0  10  20  30
1  40  50  60
2  70  80  90

In [41]:
#Demonstrate transfomr function using pandas in python
import pandas as pd
import numpy as np
import random
data = pd.DataFrame({
    'C' : [random.choice(('a','b','c')) for i in range(1000000)],
    'A' : [random.randint(1,10) for i in range(1000000)],
    'B' : [random.randint(1,10) for i in range(1000000)]

})

In [42]:
data

        C   A  B
0       a   6  8
1       a   1  1
2       b   2  6
3       c   2  7
4       b   9  4
...    ..  .. ..
999995  c   2  7
999996  a   8  4
999997  c   2  5
999998  a  10  9
999999  a   1  7

[1000000 rows x 3 columns]

In [43]:
#use the merge procedure
data.groupby('C')["A"].mean()
mean =data.groupby('C')["A"].mean().rename("N").reset_index()
df_1 = data.merge(mean)

In [44]:
data['N3'] = data.groupby(['C'])['A'].transform('mean')

In [45]:
#with apply() function

df['d'] = df.apply(lambda row: row.a + row.b + row.c, axis=1)